In [1]:
import pandas as pd

df = pd.read_csv('train.csv')

In [2]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
q1, q3 = df.Fare.quantile([0.25, 0.75])
iqr = q3 - q1

In [11]:
cond1 = df.Fare < (iqr - q1 * 1.5)
cond2 = df.Fare > (iqr + q3 * 1.5)

In [16]:
df[cond1 | cond2].Sex.value_counts().values[1]

141

In [17]:
df = pd.read_csv('basic1.csv')

In [18]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [20]:
import numpy as np

In [34]:
ndf = df[df.age != df.age.astype('int')]

In [36]:
a = ndf.age.apply(np.ceil)
b = ndf.age.apply(np.floor)
c = ndf.age.astype('int')

In [37]:
a.mean() + b.mean() + c.mean()

69.5

In [38]:
ndf = df[(df['age']-np.floor(df['age']))!= 0]
# 올림
m_ceil = np.ceil(ndf['age']).mean()

# 내림
m_floor = np.floor(ndf['age']).mean()

# 버림
m_trunc = np.trunc(ndf['age']).mean()

m_ceil, m_floor, m_trunc
print(m_ceil + m_floor + m_trunc)

69.5

In [39]:
df = pd.read_csv('basic1.csv')

In [40]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [66]:
df.isnull().sum() / len(df)

id      0.00
age     0.00
city    0.00
f1      0.31
f2      0.00
f3      0.95
f4      0.00
f5      0.00
dtype: float64

In [57]:
cond = (df.isnull().sum() / len(df) < 0.8)

In [62]:
ndf = df[cond.index]

In [71]:
dic = {}

In [72]:
for city, median in ndf.groupby('city').f1.median().items():
    dic[city] = median

In [79]:
df.f1 = df.f1.fillna(df.city.map(dic))

In [80]:
df[18:21]

      id   age city    f1  f2   f3    f4         f5
18  id19  53.0   서울  68.0   0  NaN  ISFP  83.685380
19  id20  11.0   서울  51.0   1  NaN  INTJ  91.297791
20  id21  90.0   부산  62.0   1  NaN  ISFP  29.269869

In [81]:
df = pd.read_csv('train1.csv')

In [82]:
df

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1455,1456,60,RL,62.0,7917,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,8,2007,WD,Normal,175000
1456,1457,20,RL,85.0,13175,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,MnPrv,NaN,0,2,2010,WD,Normal,210000
1457,1458,70,RL,66.0,9042,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,GdPrv,Shed,2500,5,2010,WD,Normal,266500
1458,1459,20,RL,68.0,9717,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,4,2010,WD,Normal,142125
1459,1460,20,RL,75.0,9937,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,6,2008,WD,Normal,147500

In [84]:
df.SalePrice.skew()

1.8828757597682129

In [85]:
df.SalePrice.kurt()

6.536281860064529

In [86]:
df.SalePrice = df.SalePrice.apply(np.log1p)

In [87]:
df.SalePrice.skew()

0.12134661989685333

In [88]:
df.SalePrice.kurt()

0.809519155707878

In [90]:
df = pd.read_csv('train1.csv')

In [91]:
s1 = df['SalePrice'].skew()
k1 = df['SalePrice'].kurt()
print("왜도:" ,s1)
print("첨도:" ,k1)

왜도: 1.8828757597682129
첨도: 6.536281860064529

In [93]:
df['SalePrice'] = np.log1p(df['SalePrice'])

In [94]:
s2 = df['SalePrice'].skew()
k2 = df['SalePrice'].kurt()
print("왜도:" ,s2)
print("첨도:" ,k2)

왜도: 0.12134661989685333
첨도: 0.809519155707878

In [95]:
df = pd.read_csv('basic1.csv')

In [96]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [97]:
cond1 = df.f4 == 'ENFJ'
cond2 = df.f4 == 'INFP'

In [100]:
ndf1 = df[cond1]
ndf2 = df[cond2]

In [103]:
ndf1.f1.std() - ndf2.f1.std()

-5.859621525876811

In [104]:
df = df[~(df.f1.isnull())]

In [106]:
df.groupby(['city', 'f2']).sum()

C:\Users\pc\AppData\Local\Temp\ipykernel_28260\3766061538.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['city', 'f2']).sum()

           age     f1          f5
city f2
경기   0   720.4  833.0  943.944823
     1   696.0  670.0  657.241212
     2   239.0  311.0  362.300060
대구   0   387.0  527.0  183.199568
     1   217.6  235.0  241.333824
     2   140.0  211.0   79.667919
부산   0   331.0  389.0  284.371097
     1   188.7  315.0  299.270973
     2   -13.5   47.0   67.886373
서울   0   145.0  278.0  218.528577
     1   315.3  534.0  438.485010
     2    68.3  207.0  126.661135

In [107]:
cond1 = df.city == '경기'
cond2 = df.f2 == 0
df[cond1 & cond2].f1

68    85.0
71    97.0
73    98.0
74    47.0
75    12.0
76    31.0
79    60.0
83    44.0
84    55.0
87    75.0
90    72.0
92    57.0
98    47.0
99    53.0
Name: f1, dtype: float64

In [145]:
df = pd.read_csv('basic1.csv')

In [146]:
df.f4 = df.f4.str.replace('ESTJ', 'ISTJ')

In [147]:
cond1 = df.city == '경기'
cond2 = df.f4 == 'ISFJ'

In [148]:
df[cond1 & cond2].age.max()

90.0

In [149]:
df = pd.read_csv('basic1.csv')

In [150]:
cond1 = df.f2 == 1

In [155]:
df2 = df[cond1].f1.cumsum()

In [159]:
df2.fillna(method='bfill').mean()

980.3783783783783

In [160]:
df2 = df[df['f2']==1]['f1'].cumsum()
df2 = df2.fillna(method = 'bfill')
print(df2.mean())

980.3783783783783

In [161]:
df = pd.read_csv('basic1.csv')

In [162]:
mean = df.f5.mean()
std = df.f5.std()

df.f5 = df.f5.apply(lambda x:(x-mean)/std)

In [163]:
df.f5.median()

0.2593132572746011

In [166]:
from sklearn.preprocessing import StandardScaler

df = pd.read_csv('basic1.csv')
scaler = StandardScaler()
df['f5']=scaler.fit_transform(df[['f5']])
print(df['f5'].median())

0.260619629559015

In [167]:
from sklearn.preprocessing import MinMaxScaler

In [168]:
df = pd.read_csv('basic1.csv')

In [169]:
scaler = MinMaxScaler()

In [172]:
df.f5 = scaler.fit_transform(df[['f5']])

In [174]:
bottom, top = df.f5.quantile([0.05, 0.95])

In [175]:
bottom + top

1.0248740983597389

In [184]:
df = pd.read_csv('covid-vaccination-vs-death_ratio.csv')

In [187]:
df.columns

Index(['Unnamed: 0', 'country', 'iso_code', 'date', 'total_vaccinations',
       'people_vaccinated', 'people_fully_vaccinated', 'New_deaths',
       'population', 'ratio'],
      dtype='object')

In [188]:
df = df.drop(columns='Unnamed: 0')

In [189]:
df

,country,iso_code,date,total_vaccinations,people_vaccinated,people_fully_vaccinated,New_deaths,population,ratio
0,Afghanistan,AFG,2021-05-11,504502.0,448878.0,55624.0,12,40374668.0,1.111781
1,Afghanistan,AFG,2021-05-20,547901.0,470341.0,77560.0,10,40374668.0,1.164941
2,Afghanistan,AFG,2021-05-24,573277.0,476367.0,96910.0,10,40374668.0,1.179866
3,Afghanistan,AFG,2021-05-26,590454.0,479372.0,111082.0,19,40374668.0,1.187309
4,Afghanistan,AFG,2021-05-27,593313.0,479574.0,113739.0,14,40374668.0,1.187809
...,...,...,...,...,...,...,...,...,...
32906,Zimbabwe,ZWE,2022-03-25,8691642.0,4814582.0,3473523.0,2,15229891.0,31.612715
32907,Zimbabwe,ZWE,2022-03-26,8791728.0,4886242.0,3487962.0,2,15229891.0,32.083237
32908,Zimbabwe,ZWE,2022-03-27,8845039.0,4918147.0,3493763.0,1,15229891.0,32.292726
32909,Zimbabwe,ZWE,2022-03-28,8934360.0,4975433.0,3501493.0,1,15229891.0,32.668868
32910,Zimbabwe,ZWE,2022-03-29,9039729.0,5053114.0,3510256.0,0,15229891.0,33.178924

In [201]:
df = pd.read_csv('winequality-red.csv')

In [202]:
ndf = df.corr().loc['quality', :]

In [204]:
ndf.sort_values(key=abs)

residual sugar          0.013732
free sulfur dioxide    -0.050656
pH                     -0.057731
fixed acidity           0.124052
chlorides              -0.128907
density                -0.174919
total sulfur dioxide   -0.185100
citric acid             0.226373
sulphates               0.251397
volatile acidity       -0.390558
alcohol                 0.476166
quality                 1.000000
Name: quality, dtype: float64

In [205]:
df = pd.read_csv('basic1.csv')

In [206]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [210]:
df.groupby(['city', 'f4'])['f5'].mean().sort_values(ascending=False).head(7).sum()

643.6813362975

In [225]:
ndf = df.sort_values('age', ascending=False).head(20)

In [226]:
ndf.f1 = ndf.f1.fillna(ndf.f1.median())

In [227]:
cond1 = ndf.f4 == 'ISFJ'
cond2 = ndf.f5 >= 20
ndf[cond1 & cond2]['f1'].mean()

73.875

In [223]:
ndf[cond1 & cond2]

      id   age city    f1  f2   f3    f4         f5
51  id52  97.0   대구  82.0   1  NaN  ISFJ  90.496999
72  id73  90.0   경기  63.0   1  NaN  ISFJ  73.586397
62  id63  88.0   경기  86.0   1  NaN  ISFJ  73.586397
80  id81  86.0   경기  50.0   1  NaN  ISFJ  37.113739

In [224]:
df[cond]

      id   age city    f1  f2   f3    f4         f5
3   id52  97.0   대구  82.0   1  NaN  ISFJ  90.496999
9   id73  90.0   경기  77.5   1  NaN  ISFJ  73.586397
12  id63  88.0   경기  86.0   1  NaN  ISFJ  73.586397
17  id81  86.0   경기  50.0   1  NaN  ISFJ  37.113739

In [228]:
df = pd.read_csv('basic1.csv')

In [229]:
cond = df.f2 == 0

In [230]:
ndf = df[cond].sort_values('age').head(20)

In [232]:
before = ndf.f1.var()

In [234]:
after = ndf.f1.fillna(ndf.f1.min()).var()

In [235]:
before - after

38.43732057416253

In [236]:
df = pd.read_csv('basic2.csv')

In [237]:
df

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

In [240]:
df.Date = pd.to_datetime(df.Date)

In [243]:
cond1 = df.Date.dt.year == 2022
cond2 = df.Date.dt.month == 5

In [245]:
df[cond1 & cond2]['Sales'].median()

1477685.0

In [246]:
df = pd.read_csv('basic2.csv', parse_dates=['Date'])

In [251]:
ndf = df[cond1 & cond2]

In [252]:
cond3 = ndf.Date.dt.weekday >= 5
cond4 = ndf.Date.dt.weekday < 5

In [253]:
ndf[cond3]['Sales'].mean() - ndf[cond4]['Sales'].mean()

3010339.1010101014

In [296]:
df = pd.read_csv('basic2.csv', parse_dates=['Date'])

In [302]:
def temp(x):
    if x['Events'] == 1:
        x['Sales'] *= 0.8
    return x

In [303]:
df = df.apply(lambda x:temp(x), axis=1)

In [304]:
cond1 = df.Date.dt.year == 2022
cond2 = df.Date.dt.year == 2023

In [305]:
df1 = df[cond1]
df2 = df[cond2]

In [306]:
a = df1.groupby(df1.Date.dt.month)['Sales'].sum().max()

In [307]:
b = df2.groupby(df2.Date.dt.month)['Sales'].sum().max()

In [308]:
a-b

-42473435.80000001

In [309]:
a, b

(197145878.0, 239619313.8)

In [318]:
b1 = pd.read_csv('basic1.csv')
b3 = pd.read_csv('basic3.csv')

In [319]:
df = pd.merge(b1, b3, on='f4')

In [320]:
df

      id   age city    f1  f2   f3    f4         f5    r1    r2
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2   id33  47.0   부산  94.0   0  NaN  ENFJ  17.252986  INFP  ISFP
3   id41  81.0   대구  55.0   0  NaN  ENFJ  37.113739  INFP  ISFP
4   id45  97.0   대구  88.0   0  NaN  ENFJ  13.049921  INFP  ISFP
..   ...   ...  ...   ...  ..  ...   ...        ...   ...   ...
95  id56  59.0   대구   NaN   1  vip  ESTJ  73.586397  INTP  ISFP
96  id69  75.0   경기  85.0   0  NaN  ESTJ  69.730313  INTP  ISFP
97  id72   8.0   경기  97.0   0  NaN  ESTJ  97.381034  INTP  ISFP
98  id88  89.0   경기  75.0   0  NaN  ESTJ  60.339826  INTP  ISFP
99  id94  84.0   경기   NaN   1  NaN  ESTJ  90.496999  INTP  ISFP

[100 rows x 10 columns]

In [321]:
df = df[~df.r2.isnull()]

In [323]:
ndf = df.dropna(subset='r2')

In [328]:
df.head(20).f2.sum()

16

In [329]:
ndf.head(20).f2.sum()

16

In [330]:
ndf2 = pd.merge(left=b1, right=b3, how='left', on='f4')

In [331]:
df

      id   age city    f1  f2   f3    f4         f5    r1    r2
0   id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1   id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2   id33  47.0   부산  94.0   0  NaN  ENFJ  17.252986  INFP  ISFP
3   id41  81.0   대구  55.0   0  NaN  ENFJ  37.113739  INFP  ISFP
4   id45  97.0   대구  88.0   0  NaN  ENFJ  13.049921  INFP  ISFP
..   ...   ...  ...   ...  ..  ...   ...        ...   ...   ...
95  id56  59.0   대구   NaN   1  vip  ESTJ  73.586397  INTP  ISFP
96  id69  75.0   경기  85.0   0  NaN  ESTJ  69.730313  INTP  ISFP
97  id72   8.0   경기  97.0   0  NaN  ESTJ  97.381034  INTP  ISFP
98  id88  89.0   경기  75.0   0  NaN  ESTJ  60.339826  INTP  ISFP
99  id94  84.0   경기   NaN   1  NaN  ESTJ  90.496999  INTP  ISFP

[83 rows x 10 columns]

In [333]:
ndf2

       id    age city    f1  f2   f3    f4         f5    r1    r2
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791  INFP  ISFP
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826  INFP  ISFP
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986  ESFP   NaN
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078  ENFJ  ENTJ
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869  ESFP  ESTP
..    ...    ...  ...   ...  ..  ...   ...        ...   ...   ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078  INFP   NaN
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373  ENFJ  ENTJ
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899  ENFJ  ENTJ
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034  ISFP  ISTP
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999  ISFJ  ISTJ

[100 rows x 10 columns]

In [362]:
df = pd.read_csv('basic1.csv')

In [363]:
df = df.dropna(subset='age')

In [364]:
filt = df.age >= 1

In [365]:
df = df[filt]

In [366]:
df.shape

(96, 8)

In [367]:
df = df[df['age'] == round(df['age'], 0)]

In [368]:
df.shape

(90, 8)

In [372]:
pd.qcut(df.age, 3, labels=['group1', 'group2', 'group3'])

0     group1
1     group1
2     group1
3     group3
4     group1
       ...
95    group3
96    group3
97    group2
98    group1
99    group2
Name: age, Length: 90, dtype: category
Categories (3, object): ['group1' < 'group2' < 'group3']

In [371]:
df['range'] = pd.qcut(df.age, 3, labels=['group1', 'group2', 'group3'])

In [375]:
df.groupby('range').age.median().sum()

165.0

In [376]:
df = pd.read_csv('basic2.csv', parse_dates=['Date'], index_col=0)

In [377]:
df

               Sales      PV      UV  Events
Date
2022-01-01  22711525  397349  4421.0       1
2022-01-02     36779    3969  2289.0       0
2022-01-03  13943875  373890     NaN       1
2022-01-04   8088593  142054  2157.0       0
2022-01-05   2395374  190684     NaN       0
...              ...     ...     ...     ...
2023-12-27  33846609  415067  7360.0       1
2023-12-28   3659566  208601  2262.0       1
2023-12-29   1164008   14309   193.0       0
2023-12-30   3977696   60935     NaN       0
2023-12-31   3719764   60963  1507.0       0

[730 rows x 4 columns]

In [378]:
ndf = df.resample('W')

In [383]:
sdf = ndf['Sales'].sum()

In [385]:
sdf.max() - sdf.min()

91639050

In [386]:
df = pd.read_csv('basic1.csv')

In [389]:
fill_value = df.f1.sort_values(ascending=False).head(10).values[-1]

In [390]:
df['f1'] = df['f1'].fillna(fill_value)

In [391]:
before = df['f1'].median()

In [392]:
ndf = df.drop_duplicates('age')

In [393]:
after = ndf['f1'].median()

In [394]:
before - after

0.5

In [395]:
before, after

(77.5, 77.0)

In [396]:
df = pd.read_csv('basic2.csv')

In [397]:
df

           Date     Sales      PV      UV  Events
0    2022-01-01  22711525  397349  4421.0       1
1    2022-01-02     36779    3969  2289.0       0
2    2022-01-03  13943875  373890     NaN       1
3    2022-01-04   8088593  142054  2157.0       0
4    2022-01-05   2395374  190684     NaN       0
..          ...       ...     ...     ...     ...
725  2023-12-27  33846609  415067  7360.0       1
726  2023-12-28   3659566  208601  2262.0       1
727  2023-12-29   1164008   14309   193.0       0
728  2023-12-30   3977696   60935     NaN       0
729  2023-12-31   3719764   60963  1507.0       0

[730 rows x 5 columns]

In [408]:
df['lag'] = df['PV'].shift(1)

In [410]:
df['lag'] = df['lag'].fillna(method='bfill')

In [412]:
filt1 = df.Events == 1
filt2 = df.Sales <= 1_000_000

In [414]:
df[filt1 & filt2]['lag'].sum()

1894876.0

In [415]:
df = pd.read_csv('payment.csv')

In [416]:
df

        date  hour    menu  price
0   20221129    13    딸기라떼   4000
1   20221130    12    카페라떼   3000
2   20221201    14   바닐라라떼   3500
3   20221201    16    초코라떼   3500
4   20221202    17    모카라떼   3500
5   20221202    12   카라멜라떼   3500
6   20221203     8   챠이 라떼   3500
7   20221203     9   아메리카노   2000
8   20221203    15   오곡 라떼   4000
9   20221203    16   아메리카노   2000
10  20221225    10   아메리카노   2000
11  20221225    14  토피넛 라떼   4000
12  20221225    16   카페 라떼   3000

In [425]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    13 non-null     int64
 1   hour    13 non-null     int64
 2   menu    13 non-null     object
 3   price   13 non-null     int64
dtypes: int64(3), object(1)
memory usage: 548.0+ bytes

In [426]:
df.date = df.date.astype('str')

In [429]:
filt1 = df.date.str[4:6] == '12'

In [430]:
filt2 = df.date.str[4:] == '1225'

In [434]:
total = df[filt1]['price'].sum()

In [435]:
a = df[filt2]['price'].sum()

In [437]:
int((a / total)* 100)

26

In [438]:
import pandas as pd
df = pd.DataFrame({'Name': {0: '김딴짓', 1: '박분기', 2: '이퇴근'},
                   '수학': {0: 90, 1: 93, 2: 85},
                   '영어': {0: 92, 1: 84, 2: 86},
                   '국어': {0: 91, 1: 94, 2: 83},})

df

  Name  수학  영어  국어
0  김딴짓  90  92  91
1  박분기  93  84  94
2  이퇴근  85  86  83

In [442]:
pd.melt(df, id_vars=['Name'])

  Name variable  value
0  김딴짓       수학     90
1  박분기       수학     93
2  이퇴근       수학     85
3  김딴짓       영어     92
4  박분기       영어     84
5  이퇴근       영어     86
6  김딴짓       국어     91
7  박분기       국어     94
8  이퇴근       국어     83

In [443]:
import pandas as pd
df = pd.DataFrame({'Name': {0: '김딴짓', 1: '박분기', 2: '이퇴근'},
                   '수학': {0: 90, 1: 93, 2: 85},
                   '영어': {0: 92, 1: 84, 2: 86},
                   '국어': {0: 91, 1: 94, 2: 83},})

df

  Name  수학  영어  국어
0  김딴짓  90  92  91
1  박분기  93  84  94
2  이퇴근  85  86  83

In [451]:
ndf = pd.melt(df, id_vars='Name', value_vars=['수학', '영어'])

In [452]:
ndf

  Name variable  value
0  김딴짓       수학     90
1  박분기       수학     93
2  이퇴근       수학     85
3  김딴짓       영어     92
4  박분기       영어     84
5  이퇴근       영어     86

In [453]:
filt = ndf['value'] >= 90

In [454]:
ndf[filt]['value'].mean()

91.66666666666667

In [455]:
df = pd.read_csv('basic1.csv')

In [456]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [457]:
def sigmoid(x):
    return 1 / (1 + np.exp(-x))

In [458]:
df.f2 = df.f2.apply(sigmoid)

In [459]:
filt = df.f4 == 'ISFJ'

In [460]:
df[filt].f2.sum()

7.147945627735795

In [462]:
df = pd.read_csv('basic1.csv')

In [463]:
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [464]:
def relu(x):
    if x >= 0:
        return x
    return 0

In [465]:
df.age = df.age.apply(relu)

In [466]:
filt = df.city == '부산'

In [467]:
df[filt].age.mean()

49.89473684210526